## <b>Data inconsistancies(Baytarteebi in data)
`Occurs Due to`
1. The inconsistant formats
     - Like inconsistanties in `date`
2. Inconsistant `Naming conventions`
     - Like inconsistanties in like `USA, united state,US`
3. Typographical Errors
     - Mistakes in `data entry`
     - Typo Error
4. Duplication
5. Contradictory data
     - like `father age` is less than `son` gets `inconsistancies` in the data when shows father age is less then son age

In [1]:
import pandas as pd

In [21]:
data = {
    'date': ['2021/01/01', '01-02-2021', '01-2021-03', '2021-01-04', '2021-01-05'],
    'country': ['USA', 'U.S.A', 'America', 'USA', 'USA'],
    'name': ['Alice', 'Bob', 'Charlie', 'Alice', 'Bob'],
    'sale_20': [100, 200, None, 400, 500],
    'sale_21': [110, 210, 310, 410, None]
}

#  convert the dictionary data and make pandas data frame
df = pd.DataFrame(data)

In [22]:
df.head()

         date  country     name  sale_20  sale_21
0  2021/01/01      USA    Alice    100.0    110.0
1  01-02-2021    U.S.A      Bob    200.0    210.0
2  01-2021-03  America  Charlie      NaN    310.0
3  2021-01-04      USA    Alice    400.0    410.0
4  2021-01-05      USA      Bob    500.0      NaN

In [23]:
# standardizing date format

df['date'] = pd.to_datetime(df['date'], errors='coerce')
#The errors='coerce' parameter is used to handle errors. When errors='coerce', invalid parsing will be 

# set as NaT (Not a Time).
# Convert the 'date' column in the DataFrame 'df' to a specific string format
# 'df['date']' accesses the 'date' column in the DataFrame 'df'
# '.dt' accesses the datetime properties of the 'date' column, assuming it is of datetime dtype
# '.strftime('%Y-%m-%d')' converts the datetime values to strings in the format 'YYYY-MM-DD'
# The result is assigned back to the 'date' column in the DataFrame
df['date'] = df['date'].dt.strftime('%Y-%m-%d')

df.head()

         date  country     name  sale_20  sale_21
0  2021-01-01      USA    Alice    100.0    110.0
1         NaN    U.S.A      Bob    200.0    210.0
2         NaN  America  Charlie      NaN    310.0
3         NaN      USA    Alice    400.0    410.0
4         NaN      USA      Bob    500.0      NaN

In [24]:
df['country'].value_counts()

country
USA        3
U.S.A      1
America    1
Name: count, dtype: int64

In [25]:
# Harmonize the name of the country
# Define a dictionary `country_mapping` that maps different country names to a standardized format.
# For example, it maps 'USA', 'U.S.A', and 'America' to 'United States'.
country_mapping = {'USA': 'United States', 'U.S.A': 'United States', 'America': 'United States'}

# Replace values in the 'country' column of the DataFrame `df` with the standardized format using the `replace()` method.
# The `replace()` method replaces values in the DataFrame with specified replacements based on the provided dictionary.
df['country'] = df['country'].replace(country_mapping)

In [26]:
df.head()

         date        country     name  sale_20  sale_21
0  2021-01-01  United States    Alice    100.0    110.0
1         NaN  United States      Bob    200.0    210.0
2         NaN  United States  Charlie      NaN    310.0
3         NaN  United States    Alice    400.0    410.0
4         NaN  United States      Bob    500.0      NaN

In [27]:
df['date'] = df['date'].fillna("2021-01-01")

In [39]:
# find the typographical mistakes and replace and replace
# Replace the "Bob with "Jhon Bob"
# Replace occurrences of 'Bob' with 'John Bob' in the 'name' column of the DataFrame 'df'
# 'df['name']' accesses the 'name' column in the DataFrame 'df'
# '.replace('Bob', 'John Bob')' replaces all occurrences of 'Bob' with 'John Bob' in the 'name' column
df['name'] = df['name'].replace({'Bob' : 'John Bob'})

In [41]:
df.head()

         date        country      name  sale_20  sale_21
0  2021-01-01  United States     Alice    100.0    110.0
1  2021-01-01  United States  John Bob    200.0    210.0
2  2021-01-01  United States   Charlie      NaN    310.0

In [42]:
# Remove duplicates
# Remove duplicate rows based on the 'name' column and keep only the first occurrence
df = df.drop_duplicates(subset='name')

# Display the first few rows of the DataFrame after removing duplicates
df.head()

         date        country      name  sale_20  sale_21
0  2021-01-01  United States     Alice    100.0    110.0
1  2021-01-01  United States  John Bob    200.0    210.0
2  2021-01-01  United States   Charlie      NaN    310.0

In [43]:
df = df.drop(df[df['sale_21'] <= df['sale_20']].index)
df.head()

         date        country      name  sale_20  sale_21
0  2021-01-01  United States     Alice    100.0    110.0
1  2021-01-01  United States  John Bob    200.0    210.0
2  2021-01-01  United States   Charlie      NaN    310.0